# Role
     你是一位资深的{subject}专家。

     # Task
     请根据主题【{theme}】，编写 1 篇 "Part III 阅读理解（填空）" 大题。

     # Constraints & Rules
     1.  **文章素材**: 难度 {difficulty}。
     2.  **设题要求**:
         * 在文章下方提供 5 个填空题，题号直接使用{{index}}不用数字。
         * 缩进使用{{indent}}，换行使用{{br}}。
         * 副标题用{{subtitle:标题文字}}。
         * 题目内挖空用{{short_blank}}，长下划线要求填入内容用{{long_line}}
         * 题目形式为：Summaries（摘要句）或 Information Matching（信息匹配）。
         * **挖空原则**：答案必须是文章中的原词，或者是文章信息的简单同义转换。**每空限填 1 个单词**。
     3.  **内容对应**: 题目顺序应与文章段落顺序大致一致。

     # Output Format (Standard JSON Protocol)
     请严格按照以下 **标准 UI 结构** 输出 JSON 数组。
     **严禁**包含任何 Markdown 标记。

     JSON 结构示例：
{
  "uuid": "2025_hb_eng_part3_p1",
  "title": "Part Ⅲ 阅读理解",
  "score_desc": "本篇共5小题，每题2分，共10分",
  "difficulty": "Medium",
  "content": "Passage {{br}} {{indent}}The Dong Grand Choir (侗族大歌) is a unique musical tradition of the Dong people in China. For centuries, the Dong people, who live in mountain villages of Guizhou, Guangxi, and Hunan, have used these songs to share stories, teach moral values, and celebrate nature. Unlike most choirs, there is no conductor (指挥) or written music — the harmony is created naturally by singers of all ages. {{br}} {{indent}}The songs are divided into two types: Galao (grand songs) and Gaxia (small songs). Galao are performed at festivals and tell long stories about history or love, while Gaxia are short tunes. People sing during daily work. The most amazing part is their singing style, combining different voice parts (high, middle, and low). Traditionally, children learn these songs by listening to elders while sitting around a big fire at night. {{br}} {{indent}}However, this tradition faces challenges. With many young people moving to cities for jobs, fewer villagers are there to keep the singing tradition alive. To protect the tradition, local schools have started choir classes. The Dong Grand Song Festival now attracts tourists worldwide every year. The Dong people believe that \"a song is more valuable than rice\", showing how deeply music is rooted in their culture. {{br}}{{br}} {{subtitle:The Dong Grand Choir}} {{br}} Type of Tradition: The Dong Grand Choir is a unique {{index}} {{short_blank}} tradition of the Dong people in China. {{br}} Unique Feature: Unlike most choirs, the Dong Grand Choir has no conductor or {{index}} {{short_blank}} music. {{br}} Passing-Down of Tradition: Children learn the songs by {{index}} {{short_blank}} to elders around a big fire at night. {{br}} Challenges: There are {{index}} {{short_blank}} villagers to keep the tradition alive. {{br}} Action Taken: Local school have started choir {{index}} {{short_blank}} to protect the tradition.",
  "answers": [
    "musical",
    "written",
    "listening",
    "fewer",
    "classes"
  ],
  "analyses": [
    "细节题。根据第一段第一句...",
    "细节题。根据第一段最后一句...",
    "细节题。根据第二段...",
    "推断题。根据第三段...",
    "细节题。根据第三段..."
  ]
}
     
     # Few-Shot Example (参考样本)
     {examples}
